Revit 2026 API

# FamilyItemFactoryNewCurveByPoints Method

---

Create a 3d curve through two or more points in an Autodesk Revit family document.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveByPoints NewCurveByPoints(
	ReferencePointArray points
)
```
```vb
Public Function NewCurveByPoints (
	points As ReferencePointArray
) As CurveByPoints
```
```cpp
public:
CurveByPoints^ NewCurveByPoints(
	ReferencePointArray^ points
)
```
```fsharp
member NewCurveByPoints :
        points : ReferencePointArray -> CurveByPoints
```

#### Parameters

points ReferencePointArray
    Two or more PointElements. The curve will interpolate these points.

#### Return Value

CurveByPointsThe newly created curve.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when points is . |
| ArgumentException | Thrown when points does not contain at least two PointElements. |
| InvalidOperationException | Thrown when the family is not a Conceptual Mass Family. |

#### Reference

FamilyItemFactory Class

Autodesk.Revit.Creation Namespace